In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4), ['a', 'b', 'c', 'd', 'e'], ['w', 'x', 'y', 'z'])

In [4]:
df
# w, x, y, z s√£o series que compartilham o msm index

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

### Select columns

In [5]:
display(df["w"])
print(type(df['w']))

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

<class 'pandas.core.series.Series'>

In [6]:
df[['x', 'z']]

          x         z
a  0.628133  0.503826
b -0.319318  0.605965
c  0.740122 -0.589001
d -0.758872  0.955057
e  1.978757  0.683509

### Creating column

In [7]:
# df['new'] => error

In [8]:
df['new'] = df['w'] + df['y']

In [9]:
df['new']

a    3.614819
b   -0.196959
c   -1.489355
d   -0.744542
e    2.796762
Name: new, dtype: float64

In [10]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

### Drop column

In [11]:
df.drop('new', axis=1) # n√£o esta afetenado o DataFrame

# axis = 0 -> row
# axis = 1 -> column

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [12]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
df.drop('new', axis=1, inplace=True)
# inplace = True -> O comando vai afetar o DataFrame

In [14]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

### Drop row

In [15]:
df.drop('e', inplace=True)

# axis = 0 (Default)

In [16]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [17]:
print(df.shape)
print(df.ndim)

(4, 4)
2

### Select rows

In [18]:
df.loc['b'] # pelo rotulo

w    0.651118
x   -0.319318
y   -0.848077
z    0.605965
Name: b, dtype: float64

In [19]:
df.iloc[1] # pelo index

w    0.651118
x   -0.319318
y   -0.848077
z    0.605965
Name: b, dtype: float64

In [20]:
df.loc['b', 'y']
# linha b coluna y

-0.8480769834036315

In [21]:
df.loc[['a', 'b'], ['w', 'y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

## Conditional Selection

In [22]:
bool_df = df > 0
bool_df

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True

In [23]:
df[bool_df]
# os que n√£o correspondem a condi√ß√£o
# retornam como NaN

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057

In [24]:
df[df>=0.1]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057

In [25]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [26]:
df['w']>0

a     True
b     True
c    False
d     True
Name: w, dtype: bool

In [27]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
Name: w, dtype: float64

In [28]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [29]:
resultdf = df[df['w']>0]

In [30]:
resultdf

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [31]:
resultdf['x']

a    0.628133
b   -0.319318
d   -0.758872
Name: x, dtype: float64

In [32]:
df[df['w']>0]['x']

a    0.628133
b   -0.319318
d   -0.758872
Name: x, dtype: float64

In [33]:
df[df['w']>0][['x', 'z']]

          x         z
a  0.628133  0.503826
b -0.319318  0.605965
d -0.758872  0.955057

In [34]:
boolser = df['w']>0
result = df[boolser]

In [35]:
result

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [36]:
result[['y', 'x']]

          y         x
a  0.907969  0.628133
b -0.848077 -0.319318
d -0.933237 -0.758872

In [37]:
df[(df['w'] > 0) & (df['y'] < 0)]

# & => and
# | => or

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

## More Index Details

In [38]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [39]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057

In [40]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [41]:
newind = 'CA NY WY OR'.split()

In [42]:
df['States'] = newind

In [43]:
df

          w         x         y         z States
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR

In [44]:
df.set_index('States', inplace=True)

In [45]:
df

               w         x         y         z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

In [46]:
df.loc['NY']

w    0.651118
x   -0.319318
y   -0.848077
z    0.605965
Name: NY, dtype: float64

## Multi-Index and Index Hierarchy

In [47]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [48]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [49]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [50]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [51]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [52]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [53]:
df.index.names

FrozenList([None, None])

In [54]:
df.index.names = ['Groups', "Num"]

In [55]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [56]:
print(df.loc['G2'].loc[2, 'B'])
print(df.loc['G2'].loc[2]['B'])

0.07295967531703869
0.07295967531703869

In [57]:
df.loc['G2', 2]['B']

0.07295967531703869

In [58]:
df.xs(1, level="Num")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [59]:
df.xs('G1', level='Groups')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528